UNFCOPY.саУНФУправлениеАссортиментом/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e362a3ee-cbd4-427e-ba1c-135d2ac64280">
  <name>ФизическиеЛица</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="9e14912c-3e72-43a6-bcf4-596972af9386">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="ee926eaf-dc5a-412f-a8a8-70f96c93db4b">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="843462ec-1304-440c-adf1-20e04d768d76">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="07997f2a-265a-4e2e-8e3c-73bc062af70f">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7a19d270-211a-4ffd-aa88-992e3cc0a1d2">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UNFCOPY.саУНФУправлениеАссортиментом/src/Catalogs/ФизическиеЛица/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура саУНФ_ПриСозданииНаСервереПосле2(Отказ, СтандартнаяОбработка)
	// Элементы
		
		НовыйЭлемент = Элементы.Добавить("Автомобиль", Тип("ПолеФормы"), ЭтаФорма);
		НовыйЭлемент.ПутьКДанным                    =   "Объект.Автомобиль";
		НовыйЭлемент.Вид                            =   ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ТолькоПросмотр                 =   Ложь;
		НовыйЭлемент.Подсказка                      =   "Автомобиль, закрепленный за водителем";
		НовыйЭлемент.ОтображениеПодсказки           =   ОтображениеПодсказки.Кнопка;
		НовыйЭлемент.ПоложениеЗаголовка             =   ПоложениеЗаголовкаЭлементаФормы.Лево;

КонецПроцедуры
